using System;

namespace Nestor.Thesaurus
{
    [Flags]
    public enum WordRelation
    {
        None = 0,
        Hyponym = 1, // частный случай более общего понятия (общее "птица", частное "дятел")
        SameRoot = 2, // однокоренное слово ("птица" — "птичка")
        Synset = 4, // множество всех слов, обозначающих одно понятие, синонимия ("птица", "птаха")
        Hypernym = 8, // общее над частным (частное "птица", общее — "животное")
        Domain = 16, // область знаний, к которой принадлежит понятие ("птица" — "зоология", "биология")
        PartOfSpeechSynonym = 32, // синоним с другой частью речи ("птица" — "птичий")
        Holonym = 64, // холоним — целое, для которого текущее понятие является деталью ("птица" — "стая")
        Meronym = 128, // мероним — деталь, для которой текущее понятие является целым ("птица" — "ключ")
        Association = 256, // ассоциативная связь ("птица" — "яйцо")
        Cause = 512, // причина ("птица" — "погода")
        Effect = 1024, // эффект ("птица" — "полет")
        
        DomainItem = 2048, // понятие из области знаний ("зоология" — "птица", "животное")
        RelatedAssociation = 4096, // обратная ассоциативная связь ("яйцо" — "птица")
        
        All = 8191, // все виды связей сразу
    }
}